<template>
<div>
  <b-icon-question-octagon
    class="iconsport1"
    v-b-popover.hover="'Аеробиката е комплекс от физически упражнения, които обикновено се изпълняват на фона на музика.' +
     ' Наричат се аеробни, защото са свързани с насищане на кръвта с големи количества кислород поради усилените дишане ' +
      'и кръвообращение, при което в тялото мазнините се окисляват, т.е. „изгарят“. Тя тренира и увеличава силата,' +
       ' мощността, гъвкавостта и координираността.'" />
  <b-icon-question-octagon
    class="iconsport2"
    v-b-popover.hover="'Бадминтонът е спорт, който се играе от 2 или 4 души с помощта на ракети и перце на специално' +
     ' разчертано игрище с мрежа (висока 1,55 метра). Спортът има две хилядолетна история, като води началото си от ' +
      'Гърция, Индия и Китай.'" />
  <b-icon-question-octagon
    class="iconsport3"
    v-b-popover.hover="'Баскетболът е отборен спорт с топка. Играе се от 2 отбора, най-често с по 5 играчи, на' +
     ' правоъгълно игрище. Всеки отбор се стреми да вкара в коша на противника, като в същото време се стреми да ' +
      'попречи на другия отбор да вкара топката в неговия собствен кош.'" />
  <b-icon-question-octagon
    class="iconsport4"
    v-b-popover.hover="'Ветроходство е техника за придвижване със силата на вятъра с ветроходен кораб, ветроходна яхта,' +
     ' ветроходна лодка, уиндсърф или кайтсърф по вода, с ветроходна кола по суша или с ветроходна шейна върху лед. ' +
      'То е развит спорт в много страни, като се провеждат състезания в различни класове популярни в съответния регион' +
       ' от земното кълбо.'" />
  <b-icon-question-octagon
    class="iconsport5"
    v-b-popover.hover="'Волейболът е вид колективна спортна игра с топка, по време на която два отбора се състезават на ' +
     'специална площадка, разделена с мрежа, като насочват топката в полето на противника така, че тя да падне на земята' +
      ' или противникът да допусне грешка. При това за организация на атака са допустими само три удара на топката.'" />
  <b-icon-question-octagon
    class="iconsport6"
    v-b-popover.hover="'Гребането е воден спорт с лодки. За него е характерно, че греблата имат опорна точка с лодката ' +
     '(за разлика от кану-каяк спорта, където греблата нямат опорна точка с лодката). Затова, за да работи греблото като' +
      ' лост, гребците седят с гръб към посоката на движение. При гребане те използват основно силата на краката си чрез' +
       ' специална седалка (наречена слайд) движеща се върху релси (наречени ролбани). Има 2 вида лодки – „разпашни“' +
        ' (всеки гребец гребе с гребло, което държи с двете ръце) и „скул“ (всеки гребец гребе с 2 гребла, по едно във ' +
         'всяка ръка). Единият от гребците на двойната лодка се нарича носови – стои на носа и следи темпото (ритъма на' +
          ' загребване) на другия – наречен загребни, стоящ на бака на лодката. Лодката с 1 гребец се нарича скиф. Има ' +
           'също и лодки за четирима гребци, като и за осмина гребци (където всеки гребец винаги е с по 1 гребло).'" />
  <b-icon-question-octagon
    class="iconsport7"
    v-b-popover.hover="'Планинарството е вид спорт, при който човек придобива умения да се ориентира по - лесно в' +
     'природата(а в повечето случаи именно тя му подсказва къде човек се намира). Боравенето с карта на район и компас' +
      'не е излишно умение за никого, разпознаването на посоките на света само по дадени от природата обекти, или ' +
       'изкачването на планини, това са едно от малките неща, които може да научите в този специфичен спорт.'" />
  <b-icon-question-octagon
    class="iconsport8"
    v-b-popover.hover="'Плуването е начин на придвижване във водата посредством движение на тялото.\n'+
'Усвоимо е от човека и повечето животни. То  е вторият по популярност индивидуален спорт в света. Според някои експерти' +
 ' в далечното бъдеще плуването ще стане спорт № 1 на планетата. Умението да плуват помага значително на хората да ' +
  'практикуват много други дейности и спортове като водни ски, водна топка, риболов или гребане.\n'" />
  <b-icon-question-octagon
    class="iconsport9"
    v-b-popover.hover="'Скалното катерене е вид екстремен спорт, представляващ катерене по скални образувания. Има ' +
     'различни дисциплини с различна степен на опасност и различни изисквания.'" />
  <b-icon-question-octagon
    class="iconsport10"
    v-b-popover.hover="'Тенис (или тенис на корт) е спорт, който се е играе от 2-ма (при игра на сингъл – поединично) ' +
     'или 4-ма души (при игра на двойки). Състезателите използват ракета с опъната корда, за да удрят малка гумена топка' +
      ' над мрежа в полето на опонента. Тенисът е измислен във Франция в края на XII век, но тогава все още не е имало' +
       ' ракети, а топката е удряна с ръка. Ракетите се появяват през XVI век и оттогава играта се нарича „тенис“. Тя ' +
        'бързо се разпространява във Франция и Англия, основно сред високите класи в обществото – например крал Хенри' +
         ' VIII е имал специална зала за тенис, но кралският тенис се е отличавал от днешната игра.'" />
  <b-icon-question-octagon
    class="iconsport11"
    v-b-popover.hover="'Тенис на маса (също и пинг-понг) е спорт, практикуван от двама или четирима играчи, които удрят' +
     ' топче за тенис на маса с помощта на хилка. Играе се на тенис маса, разделена по средата от мрежа. Целта на играча' +
      ' е да не позволи на топчето да докосне повече от един път от неговата страна на масата и да го върне, така че то' +
       ' да тупне повече от един път в срещуположната страна на масата или, ако докосне само веднъж, другият играч да не' +
        ' може да го върне обратно.'" />
  <b-icon-question-octagon
    class="iconsport12"
    v-b-popover.hover="'Футболът е отборен спорт, който се играе от два отбора по единадесет души със сферична топка, ' +
     'която тежи от 400 до 450 грама. Той е най-известният спорт на света. \n'+
'Играе се на правоъгълно поле, покрито с естествена или изкуствена трева, като целта е топката да бъде вкарана във' +
 ' вратата на противника, при което се отбелязва гол. Вратите на двата отбора са разположени на късите страни на ' +
  'правоъгълното поле. По време на игра само вратарите имат право да докосват топката с ръка, а останалите играчи ' +
   'обикновено я ритат с крака и в редки случаи я пресрещат с тялото или главата си. Когато някой от полевите играчи' +
    ' (без вратаря) докосне топката с ръка главният съдия или отсъжда нарушение или показва червен или жълт картон на ' +
     'нарушителя. Мачът се печели от отбора, отбелязал повече голове. При равен брой голове, в зависимост от' +
      ' изискванията на състезанието, резултатът може да се обяви за равен или играта да продължи в допълнително време' +
       ' или с дузпи.\n'" />
</div>
</template>

<script>
export default {
  name: 'IconsSports'
}
</script>

<style scoped>
.iconsport1 {
  position: absolute;
  top: 140px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport2 {
  position: absolute;
  top: 240px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport3 {
  position: absolute;
  top: 335px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport4 {
  position: absolute;
  top: 430px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport5 {
  position: absolute;
  top: 530px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport6 {
  position: absolute;
  top: 630px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport7 {
  position: absolute;
  top: 680px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport8 {
  position: absolute;
  top: 775px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport9 {
  position: absolute;
  top: 870px;
  right: 1038px;
  color: #ddffdd;
}
.iconsport10 {
  position: absolute;
  top: 920px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport11 {
  position: absolute;
  top: 970px;
  right: 1050px;
  color: #ddffdd;
}
.iconsport12 {
  position: absolute;
  top: 1020px;
  right: 1050px;
  color: #ddffdd;
}
</style>
